{
  "_num_labels": 9,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-PER",
    "1": "B-ORG",
    "2": "I-ORG",
    "3": "B-LOC",
    "4": "O",
    "5": "I-LOC",
    "6": "I-PER",
    "7": "B-MISC",
    "8": "I-MISC"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-LOC": 3,
    "B-MISC": 7,
    "B-ORG": 1,
    "B-PER": 0,
    "I-LOC": 5,
    "I-MISC": 8,
    "I-ORG": 2,
    "I-PER": 6,
    "O": 4
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 3,
  "type_vocab_size": 2,
  "vocab_size": 30000
}
